Какова моя роль в системе цифрового образования.
Так как в будущем я буду педагогом дополнительного образования. И в век цифровых технологий глупо осуществлять обучение, не используя новые передовые образовательные технологии, применять прогрессивные формы организации образовательного процесса и активных методов обучения.

Современное образование даёт все условия для всестороннего развития людей. Нам нужно изучать то, что пригодиться нам в будущем. Безусловно, это не сделать без инновационного подхода. 

И все же какова моя роль в системе цифрового образования? Я могу использовать технологии для подготовки к занятию ,так же могу применять и во время занятия Работать на уроке или дистанционно. Также я могу , применяя цифровые технологии, взаимодействовать с другими педагогами даже на расстоянии.

Цифровое образование – это шаг навстречу продвинутому будущему, как для детей, так и для педагогов. Роль педагога, а в частности так же и меня, внедрить эти цифровые технологии в современную систему образования, а главное, сделать это правильно!

